-- phpMyAdmin SQL Dump
-- version 4.1.8
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2015-12-20 15:40:07
-- 服务器版本： 5.5.37-log
-- PHP Version: 5.4.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `lab_work`
--

-- --------------------------------------------------------

--
-- 表的结构 `class`
--

CREATE TABLE IF NOT EXISTS `class` (
  `class_id` int(4) NOT NULL AUTO_INCREMENT,
  `user_id_build` varchar(20) NOT NULL,
  `class_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `class_url` varchar(50) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `class_member_amount` int(4) NOT NULL DEFAULT '0',
  PRIMARY KEY (`class_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=2 ;

--
-- 转存表中的数据 `class`
--

INSERT INTO `class` (`class_id`, `user_id_build`, `class_name`, `class_url`, `class_member_amount`) VALUES
(1, '1', '计算机网络', 'down/1/', 99);

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `user_id` int(4) NOT NULL AUTO_INCREMENT,
  `username` varchar(20) NOT NULL,
  `userpass` varchar(40) NOT NULL,
  `user_type` varchar(2) NOT NULL DEFAULT '0' COMMENT '0学生1老师',
  `user_class` varchar(1000) NOT NULL,
  `user_reallname` varchar(30) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '----' COMMENT '用户姓名',
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=101 ;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`user_id`, `username`, `userpass`, `user_type`, `user_class`, `user_reallname`) VALUES
(1, 'lvze', '40bd001563085fc35165329ea1ff5c5ecbdbbeef', '1', ';1', '吕泽'),
(2, '1111', '011c945f30ce2cbafc452f39840f025693339c42', '0', ';1;', '小明'),
(3, '020332010055', '26257010fc6fc4bd34d8bb3606d7e36d236eb19e', '0', ';1;', '李杨'),
(4, '090112011057', '405ec36b9f2c74e1ce3f552cb77840887774e662', '0', ';1;', '----'),
(5, '12020031018', 'abc38cb69600898d9bfa7002ba694f8cc015b3a3', '0', ';1;', '丁瑜'),
(6, '12020031024', 'ab11d55f8f223d91d94b2f0653fbc804b2c173c0', '0', ';1;', '----'),
(7, '12020031039', '3f9d2c2a04c9722047b9e5196d17dcd990a95016', '0', ';1;', '荆晓贝'),
(8, '12020031086', 'e541bd7ac0004825f2cf1ca9e3b87f7810376813', '0', ';1;', '----'),
(9, '13020031004', '3d02c77c20148baee6e6a13a5a9d3a918b28f319', '0', ';1;', '陈广军'),
(10, '13020031007', '7d0460fd84c4319df5af542dd336360c2e9d137a', '0', ';1;', '陈睿'),
(11, '13020031008', '4077809ac80000e3d8e2a31f5ed26ebd11e80000', '0', ';1;', '----'),
(12, '13020031012', 'd013190e229d0d378ab80c7d8e6c310f887c383d', '0', ';1;', '----'),
(13, '13020031016', '6c749702eefa1c302d592f9723c4824ca4e85aa8', '0', ';1;', '----'),
(14, '13020031017', 'f1e5f7463714adee63c458d943162c13f5edc470', '0', ';1;', '范宗源'),
(15, '13020031018', '43f5e3cc1a69945cdee915e968cb0daeb4d3b304', '0', ';1;', '冯凯杰'),
(16, '13020031023', '756d9fc644ced272b4deb4f0a98947c325490ddf', '0', ';1;', '高远宁'),
(17, '13020031026', '44ff72a951f2f02517bf11d4d0bc796ad6786241', '0', ';1;', '郭浩'),
(18, '13020031029', 'be90b36f9051c852f106160c2fea629d7db15420', '0', ';1;', '何珺'),
(19, '13020031030', 'e304b6d3dde162e6d3355637df2008238ebdcf25', '0', ';1;', '何军'),
(20, '13020031036', '442f5d1760dac205d6fcf2db8b45463b50ac356a', '0', ';1;', '呼听雨'),
(21, '13020031038', '864b956d277c45a346f1bd4fb385873a266edb5c', '0', ';1;', '黄安迪'),
(22, '13020031042', '6d0e29ea8b330550c34dda7a95012fdf228111e1', '0', ';1;', '----'),
(23, '13020031043', '92266479691baee67c17ec771acc5fb304fc3b2f', '0', ';1;', '----'),
(24, '13020031044', '17f2b0095264eda9e5acd2857a100e5353100af3', '0', ';1;', '----'),
(25, '13020031045', '16c830e0d8150b1c6de2840ee6ed2b22ce1bec40', '0', ';1;', '----'),
(26, '13020031046', '85793ea1a29e5e05ac92685f16d0b671c42125fd', '0', ';1;', '----'),
(27, '13020031047', 'a63c89cdb801ff9bc24ece0c695cd9cf929cd6e1', '0', ';1;', '----'),
(28, '13020031048', '654a8f8ebe7c401e8248b6a44b338aa5e2c402af', '0', ';1;', '李鹏宇'),
(29, '13020031052', '518c5b2a1fa560cf34cf090adcf8f09e1d771ca8', '0', ';1;', '李涛'),
(30, '13020031055', '395855f3a2c8cd40a6023325a4600accd9ec677a', '0', ';1;', '李延鑫'),
(31, '13020031057', '1b535d7d46a65d4cf4bed22d4cc57546ecad78b4', '0', ';1;', '李阅'),
(32, '13020031058', 'e798f7f808a44b72e338177607133c5c8ec5e0d3', '0', ';1;', '----'),
(33, '13020031059', 'be3c1443b7bb5d5330bff6f2cd19f33d995f2806', '0', ';1;', '李姝浩'),
(34, '13020031060', 'c4ba89c84f7d012c8d7a2c52c095672e839ac586', '0', ';1;', '----'),
(35, '13020031061', '68e9cdef1cb5164830668e544a5e1a2082999f86', '0', ';1;', '----'),
(36, '13020031062', '075fc443860d3ec5af9286fa19dd2a4a8b6744d4', '0', ';1;', '林思达'),
(37, '13020031063', '39124c09f1423af890fc10646c5f26fc8177b5c8', '0', ';1;', '凌峰江'),
(38, '13020031064', 'b7efc66ccd4fb9635a92bf97865ce71a66ec93fb', '0', ';1;', '刘聪'),
(39, '13020031065', '530cabe001a1faa8f98b37add37d091c62c1e850', '0', ';1;', '----'),
(40, '13020031066', '8b1d2434d7cc4f768b60d85faf2ab13481583629', '0', ';1;', '----'),
(41, '13020031067', 'f4ad090bc9219d9767a08dfa879073ce3482f2c4', '0', ';1;', '刘凯'),
(42, '13020031068', 'e22d565f0f4dd9b271ab810918b5ff9705ac716f', '0', ';1;', '刘帅'),
(43, '13020031069', '5e786e99c5f1984f3fa8ca93df5a376361a45db5', '0', ';1;', '----'),
(44, '13020031070', 'ed3ccaff1292890cc53c7b3cb78e48e0c7cb774e', '0', ';1;', '刘文乐'),
(45, '13020031071', 'af5f4f2dc18db1ad735027918f783009c8eec931', '0', ';1;', '刘笑语'),
(46, '13020031072', 'ef19c87e99057a566503ed42f0c5d02060775657', '0', ';1;', '----'),
(47, '13020031073', '7c21222c04b858b73cd5a646e25bb96dda8f3ed9', '0', ';1;', '----'),
(48, '13020031074', '2a986d4bbcaeaaace748966306a7a5d546c6c9ec', '0', ';1;', '----'),
(49, '13020031076', '0cd5bed2d78ca0740fed9cf6fce3a37ddb7f8733', '0', ';1;', '刘瑾萱'),
(50, '13020031078', '592ee2ead894bcce08059ec101045431ed84568e', '0', ';1;', '刘祯昆'),
(51, '13020031080', 'fdecb848a8828a9022e3454e05f41be8f29e5088', '0', ';1;', '罗梁'),
(52, '13020031081', '989088cabcbaacd50d03a05039951e0d0067b970', '0', ';1;', '----'),
(53, '13020031082', '2a344fcbe7d8fc2dcbdab785cff9fcfa6d257d63', '0', ';1;', '----'),
(54, '13020031083', '2e87c564431528d52d5cad1eee111d8de35823c0', '0', ';1;', '马俊睿'),
(55, '13020031084', 'f8b5393290cab7b5f9052e5782ec3fada854d673', '0', ';1;', '马鹏鹏'),
(56, '13020031085', '13c38c8c6c0a5eed4eab3b6e3265e98ab9ce1ffe', '0', ';1;', '蒙梦雨'),
(57, '13020031088', '0e507ec2766a90eb6e651330a3b79bb1f9fc6e0b', '0', ';1;', '----'),
(58, '13020031089', 'b3b3f2967b875f1e5f1cfdd18059190a4bdaa777', '0', ';1;', '----'),
(59, '13020031093', '7110eda4d09e062aa5e4a390b0a572ac0d2c0220', '0', ';1;', '石玥'),
(60, '13020031094', 'fade6651cb40a032a65d03a569a903267f4ef6bf', '0', ';1;', '石健'),
(61, '13020031095', '400dceb8424fd5abd173ecbfb72e7db9ed87113c', '0', ';1;', '----'),
(62, '13020031099', '4ccb46269cad63df29b9002757066bdacff1f444', '0', ';1;', '宋阳'),
(63, '13020031100', '54a68bb1a6b427f8a74b6a3d0eebb7dc478da9c3', '0', ';1;', '孙娜'),
(64, '13020031101', '1b1a7eb9da2721c24f2197e005cdff8497844b0f', '0', ';1;', '孙腾飞'),
(65, '13020031102', 'b51c6926a31888a3743be4619e068f4e49acc319', '0', ';1;', '----'),
(66, '13020031103', '12e20c0976031d9d767efbac2221d89f7ba8a73f', '0', ';1;', '唐宁'),
(67, '13020031104', 'ec7b8f4906f54c49dc4afdcc3f66758292113316', '0', ';1;', '----'),
(68, '13020031105', 'b17e8f7fa3a3ac6c525404813d82781849a0b2ee', '0', ';1;', '----'),
(69, '13020031106', '782eda90bf48ecd761b669e939ca93deb86653e5', '0', ';1;', '田茂伟'),
(70, '13020031107', '618f533ff995cf9c6fc7fe8204d4eb3beb3037b8', '0', ';1;', '----'),
(71, '13020031108', 'e0a5c3b7175d1875211d3774f37ad9c2abe03799', '0', ';1;', '王春智'),
(72, '13020031109', 'a218f0b0b763a1abd79e67c9137d01dadd4b91dc', '0', ';1;', '王翰青'),
(73, '13020031110', '2d818aee9c0416781a67d31339dcbdf45c3b1664', '0', ';1;', '----'),
(74, '13020031111', '221e12318825afbd246b220d5c17200ce6e0e418', '0', ';1;', '----'),
(75, '13020031112', 'edc5f9e949b299894f812e82f85cd0e8cf07c85b', '0', ';1;', '王乐'),
(76, '13020031113', '082fde349709a6270bccef0c0084e0fbdd95c2a0', '0', ';1;', '----'),
(77, '13020031114', '620e44f64ebcd62ec4faf35ee44d40868a8e16be', '0', ';1;', '王伟成'),
(78, '13020031115', 'fe248d3f99a83830d8acde90d303696dd0392e02', '0', ';1;', '王晓旭'),
(79, '13020031116', '38cc0f0b24522796467e7f76765d6e5349347880', '0', ';1;', '----'),
(80, '13020031117', 'b6feac88d0bf2567fd5595a9b6e8512dafb319a3', '0', ';1;', '王瑶'),
(81, '13020031118', '45dc025396afe0f35d0e906b18fb9362b8e7916a', '0', ';1;', '王叶婷'),
(82, '13020031126', '30f0de2e041b5b4af92d89785b622572eb946a02', '0', ';1;', '----'),
(83, '13020031127', 'c0a97bfe6c9fc0b6073b19f75c5b7c499752455d', '0', ';1;', '----'),
(84, '13020031130', '9197b9fec5bd9c57281f25bc7b5d7d5e4b23e753', '0', ';1;', '徐正'),
(85, '13020031131', '2f708b0ef2a86d961374cf64ee2ac1bbee547109', '0', ';1;', '----'),
(86, '13020031140', '5310e548f73822983f9e89874ad5161084849cbe', '0', ';1;', '----'),
(87, '13020031146', '6d2977cdc8b205ece98603f5a69b77770a6dc421', '0', ';1;', '----'),
(88, '13020031157', 'a89443c1dbb9573ad7321c4d59107b87ac3c6e73', '0', ';1;', '张亚浩'),
(89, '13020031160', 'e647a4488020be322c6934fa8de8bd6861a09751', '0', ';1;', '赵汉青'),
(90, '13020031163', 'c7d1d955aa4edb974e204e6a8f1a5ab9452ad60f', '0', ';1;', '赵硕'),
(91, '13020031167', '07b30cb867d240fd1d97b75bd68df45ab7693bac', '0', ';1;', '郑慧莹'),
(92, '13020031168', '25fa415cfe784c758d99815e5435752305b7c2d1', '0', ';1;', '郑小红'),
(93, '13020031182', '0bd88e90f307438e1f45bd7995d8acb965475271', '0', ';1;', '訾越洋'),
(94, '13020031801', '39d448a599b221f3683250fab6ceaed2cf4f19bd', '0', ';1;', '徐奔'),
(95, '13040031001', '774aa796305eef2e1f70266e0329847648a90528', '0', ';1;', '----'),
(96, '13070011005', 'ae453e5023e53054d24a5692db66f24db7abf873', '0', ';1;', '陈星南'),
(97, '13150011029', 'f7a56ebb99a8e17ea1bb8f6584ea97a7534629dc', '0', ';1;', '----'),
(98, '13150032056', '8f79db9d8a36513b1cdf07f0b0b5a6fe99ed43e5', '0', ';1;', '张明炜'),
(99, '13170021034', 'b1fa315b7fbaa5427ab43cb8b7ef84d9f7c9a4c8', '0', ';1;', '王一萌'),
(100, '14020031021', 'd7e6781aadaba495869247147fbe756aa99d8564', '0', ';1;', '----');

-- --------------------------------------------------------

--
-- 表的结构 `work`
--

CREATE TABLE IF NOT EXISTS `work` (
  `work_id` int(4) NOT NULL AUTO_INCREMENT,
  `class_id` varchar(20) NOT NULL,
  `work_name` varchar(60) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `work_url` varchar(50) NOT NULL,
  `work_done_amount` int(4) NOT NULL DEFAULT '0',
  `dead_time` datetime NOT NULL,
  `work_txt` varchar(1000) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT 'readme.txt',
  `work_detail` varchar(1000) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT 'attachment',
  PRIMARY KEY (`work_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=5 ;

--
-- 转存表中的数据 `work`
--

INSERT INTO `work` (`work_id`, `class_id`, `work_name`, `work_url`, `work_done_amount`, `dead_time`, `work_txt`, `work_detail`) VALUES
(3, '1', 'upload', 'down/1/3', 2, '2025-12-11 00:00:00', 'down/1/3/readme.txt', '');

-- --------------------------------------------------------

--
-- 表的结构 `workdone`
--

CREATE TABLE IF NOT EXISTS `workdone` (
  `user_id` int(4) NOT NULL,
  `work_id` int(4) NOT NULL,
  `work_done` int(4) NOT NULL DEFAULT '0' COMMENT '提交1次+1',
  `workdone_url` varchar(100) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `grade` varchar(4) DEFAULT NULL COMMENT '分数'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `workdone`
--

INSERT INTO `workdone` (`user_id`, `work_id`, `work_done`, `workdone_url`, `grade`) VALUES
(2, 1, 1, 'down/1/1/1111_小明_下载提交测试_1449089311.docx', NULL),
(41, 1, 1, 'down/1/1/13020031067_刘凯_下载提交测试_1449143770.docx', NULL),
(3, 1, 1, 'down/1/1/020332010055_李杨_下载提交测试_1449201436.zip', NULL),
(96, 1, 1, 'down/1/1/13070011005_陈星南_下载提交测试_1449564427.docx', NULL),
(51, 1, 1, 'down/1/1/13020031080_罗梁_下载提交测试_1449618918.docx', NULL),
(33, 1, 1, 'down/1/1/13020031059_李姝浩_下载提交测试_1449561550.docx', NULL),
(7, 1, 1, 'down/1/1/12020031039_荆晓贝_下载提交测试_1449569584.docx', NULL),
(66, 1, 1, 'down/1/1/13020031103_唐宁_下载提交测试_1449662928.docx', NULL),
(31, 1, 1, 'down/1/1/13020031057_李阅_下载提交测试_1449747514.docx', NULL),
(49, 1, 1, 'down/1/1/13020031076_刘瑾萱_下载提交测试_1449887784.docx', NULL),
(60, 1, 1, 'down/1/1/13020031094_石健_下载提交测试_1449911408.docx', NULL),
(18, 1, 1, 'down/1/1/13020031029_何珺_下载提交测试_1449920686.docx', NULL),
(93, 1, 1, 'down/1/1/13020031182_訾越洋_下载提交测试_1449861445.docx', NULL),
(21, 1, 1, 'down/1/1/13020031038_黄安迪_下载提交测试_1449841398.docx', NULL),
(17, 1, 1, 'down/1/1/13020031026_郭浩_下载提交测试_1449844997.docx', NULL),
(17, 1, 1, 'down/1/1/13020031026_郭浩_下载提交测试_1449898827.docx', NULL),
(19, 1, 1, 'down/1/1/13020031030_何军_下载提交测试_1449896793.docx', NULL),
(84, 1, 1, 'down/1/1/13020031130_徐正_下载提交测试_1449886535.docx', NULL),
(30, 1, 1, 'down/1/1/13020031055_李延鑫_下载提交测试_1449845472.docx', NULL),
(14, 1, 1, 'down/1/1/13020031017_范宗源_下载提交测试_1449921060.docx', NULL),
(10, 1, 1, 'down/1/1/13020031007_陈睿_下载提交测试_1449871455.docx', NULL),
(45, 1, 1, 'down/1/1/13020031071_刘笑语_下载提交测试_1449834634.docx', NULL),
(44, 1, 1, 'down/1/1/13020031070_刘文乐_下载提交测试_1449923836.docx', NULL),
(91, 1, 1, 'down/1/1/13020031167_郑慧莹_下载提交测试_1449869499.docx', NULL),
(92, 1, 1, 'down/1/1/13020031168_郑小红_下载提交测试_1449853799.docx', NULL),
(37, 1, 1, 'down/1/1/13020031063_凌峰江_下载提交测试_1449841076.docx', NULL),
(72, 1, 1, 'down/1/1/13020031109_王翰青_下载提交测试_1449863054.txt', NULL),
(62, 1, 1, 'down/1/1/13020031099_宋阳_下载提交测试_1449879373.doc', NULL),
(2, 3, 14, 'down/1/3/1111_小明_upload_1450656539.rar', NULL),
(78, 1, 1, 'down/1/1/13020031115_王晓旭_下载提交测试_1449843841.docx', NULL),
(56, 1, 1, 'down/1/1/13020031085_蒙梦雨_下载提交测试_1449852326.docx', NULL),
(15, 1, 1, 'down/1/1/13020031018_冯凯杰_下载提交测试_1449864019.docx', NULL),
(77, 1, 1, 'down/1/1/13020031114_王伟成_下载提交测试_1449938959.docx', NULL),
(59, 1, 1, 'down/1/1/13020031093_石玥_下载提交测试_1450225389.docx', NULL),
(54, 1, 1, 'down/1/1/13020031083_马俊睿_下载提交测试_1450271688.docx', NULL),
(54, 4, 1, 'down/1/4/13020031083_马俊睿_实验二常用网络服务的配置_1450276792.docx', NULL),
(94, 1, 1, 'down/1/1/13020031801_徐奔_下载提交测试_1450331794.docx', NULL),
(55, 1, 1, 'down/1/1/13020031084_马鹏鹏_下载提交测试_1450339201.docx', NULL),
(90, 2, 2, 'down/1/2/13020031163_赵硕_实验一基本网络操作命令_1450384670.rar', NULL),
(90, 4, 2, 'down/1/4/13020031163_赵硕_实验二常用网络服务的配置_1450355881.rar', NULL),
(93, 2, 1, 'down/1/2/13020031182_訾越洋_实验一基本网络操作命令_1450405034.zip', NULL),
(93, 4, 1, 'down/1/4/13020031182_訾越洋_实验二常用网络服务的配置_1450384054.zip', NULL),
(49, 4, 1, 'down/1/4/13020031076_刘瑾萱_实验二常用网络服务的配置_1450340681.zip', NULL),
(96, 4, 1, 'down/1/4/13070011005_陈星南_实验二常用网络服务的配置_1450392542.zip', NULL),
(96, 2, 1, 'down/1/2/13070011005_陈星南_实验一基本网络操作命令_1450435219.docx', NULL),
(20, 1, 1, 'down/1/1/13020031036_呼听雨_下载提交测试_1450379094.docx', NULL),
(42, 1, 1, 'down/1/1/13020031068_刘帅_下载提交测试_1450362367.docx', NULL),
(30, 4, 1, 'down/1/4/13020031055_李延鑫_实验二常用网络服务的配置_1450364416.rar', NULL),
(3, 4, 1, 'down/1/4/020332010055_李杨_实验二常用网络服务的配置_1450414087.doc', NULL),
(31, 4, 1, 'down/1/4/13020031057_李阅_实验二常用网络服务的配置_1450418404.rar', NULL),
(14, 2, 1, 'down/1/2/13020031017_范宗源_实验一基本网络操作命令_1450403005.docx', NULL),
(31, 2, 1, 'down/1/2/13020031057_李阅_实验一基本网络操作命令_1450400263.rar', NULL),
(33, 4, 1, 'down/1/4/13020031059_李姝浩_实验二常用网络服务的配置_1450421941.zip', NULL),
(9, 3, 1, 'down/1/3/13020031004_陈广军_upload_1450386590.docx', NULL),
(75, 2, 1, 'down/1/2/13020031112_王乐_实验一基本网络操作命令_1450397342.zip', NULL),
(75, 4, 1, 'down/1/4/13020031112_王乐_实验二常用网络服务的配置_1450365731.docx', NULL),
(30, 2, 1, 'down/1/2/13020031055_李延鑫_实验一基本网络操作命令_1450393780.rar', NULL);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
