<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=gb2312" />
<title>测试页面03</title>
<style>
.para{
text-indent: 2em;
font-size: 14px;
color: #333;
margin-bottom: 15px;
word-wrap: break-word;
line-height: 24px;
}
</style>
</head>

<body>
<div class="para" style="width:600px; margin:20px auto;">中国海洋大学（Ocean University of China），简称海大或中国海大（OUC），原名私立青岛大学，位于山东省青岛市，始建于1924年，2002年更名为中国海洋大学。学校是教育部直属重点综合性大学，是国家“985工程”和“211工程”重点建设高校之一，入选2011计划、111计划、北极大学联盟、IAMRI联盟、海洋大学联盟、是国务院学位委员会首批批准的具有博士、硕士、学士学位授予权的单位，国家首批卓越农林人才教育培养计划、卓越工程师教育培养计划改革试点高校，世界大学学术排名内地排名33，青岛海洋科学与技术国家实验室牵头高校</div>

<div class="para" style="width:600px; margin:20px auto;">
1924年8月，直系要员高恩洪选用德国侵占青岛时所建俾斯麦兵营（现鱼山校区北半部分）为校址，创办了私立青岛大学。
</div>
<div class="para" style="width:600px; margin:20px auto;">
1925年5月，直奉战争再起，直系败北，校长高恩洪被逼去职。1925年只招收了铁路管理科学生20人，1926至1927年未再招生，1928年5月停办，学生均按结业处理。
</div>
<div class="para" style="width:600px; margin:20px auto;">
1928年8月，南京国民政府教育部批准由何思源、杨振声、赵太侔、杜光埙等11人组成筹备委员会，着手在济南筹建国立山东大学，但因"五三"惨案后日本拒不从济南撤兵，筹备工作无法进行。1929年6月，国民政府教育部接受著名教育家蔡元培的建议，指令将国立山东大学筹委会改为国立青岛大学筹委会，在青岛筹建国立青岛大学，校址就选在原私立青岛大学。
</div>
<div class="para" style="width:600px; margin:20px auto;">
截至2015年9月，学校有教职工3000余人，其中专任教师1600余人，博士生导师350余人。学校有中国科学院院士4人、中国工程院院士5人，“千人计划”特聘教授6人，国家杰出青年科学基金获得者17人，“长江学者”16人，山东省“泰山学者”特聘教授24人，“筑峰人才工程”、“绿卡人才工程”、“繁荣人才工程”岗位教授39人，国家级有突出贡献的中青年专家9人，973计划和重大科学研究计划项目首席科学家10人，国家自然科学基金委创新研究群体2 个，科技部重点领域创新团队2个，教育部“长江学者”创新团队4个，享受国务院政府特殊津贴专家112人，
行远楼
行远楼
国家“百千万人才工程”一二层次人才11人，科技部中青年科技创新领军人才3人，教育部新（跨）世纪人才107人。中国当代著名作家王蒙担任学校顾问、教授、文学与新闻传播学院名誉院长，国家海洋局原局长王曙光受聘学校顾问、教授、海洋发展研究院院长，国际著名物理学家钱致榕受聘学校顾问、特聘讲席教授、行远书院院长，6位诺贝尔奖获得者受聘为名誉教授，诺贝尔文学奖获得者莫言等12位知名作家受聘为“驻校作家”，还有500多位国内外专家、学者组成的“客座教授团”以及来自十几个国家的40多位专家、学者组成的“海外教授团”。
</div>
<div class="para" style="width:600px; margin:20px auto;">

截至2013年12月，中国海洋大学有1个国家实验室[3]  、1个国家工程技术研究中心、7个教育部重点实验室、
院系楼
院系楼
4个教育部工程研究中心，1个农业部重点实验室、2个山东省重点实验室、1个山东省工程技术研究中心、9个山东省“十二五”高校重点实验室、4个青岛市重点实验室、1个青岛市工程研究中心。联合国教科文组织中国海洋生物工程中心、由教育部和国家海洋局共建的中国海洋发展研究中心设在学校。学校拥有4个教育部-国家外国专家局111创新引智基地，1个“985工程”哲学社会科学创新基地，1个教育部人文社会科学重点研究基地，1个国家文化产业研究中心和4个山东省人文社会科学研究基地，2个山东省“十二五”高等学校人文社会科学研究基地。
</div>
<div class="para" style="width:600px; margin:20px auto;">

学校拥有供教学实践和科学考察使用的3500吨级“东方红2号”
东方红2号
东方红2号
海洋综合科学考察实习船、与企业合作共建共管2600吨级“海大号”海洋地质地球物理调查船、280吨的“天使1”科考交通补给船，5000吨级的“东方红3”新型深远海综合科考实习船正在建造过程中，基本组成了自近岸、近海至深远海并辐射到极地的海上综合流动实验室，初步形成了国内一流的系统化的现场观测能力。青岛海洋科学与技术国家实验室一期启动区综合楼及高性能科学计算与系统仿真平台已经完工，即将投入使用；作为山东半岛蓝色经济区的重点项目和青岛“蓝色硅谷”的核心区，二期、三期建设工程已经启动，将为国家和地方的海洋事业发展提供空间载体和科技支撑。
</div>
</body>
</html>
